
// регулярные выражения = для поиска строк, удаления
// regex101.com
// var - hoisting (всплывает вверх)\ добавляет в объект window\ можно перепределять
// let - нельзя перепределять\область видимости в блоке кода\

// FD - всплывает, можно вызвать, потом объявить
// FE - 
// typeof - возвращает тип,
// delete - удаляет объект, возвращает tru;
// instanceof - принадлежит ли переменная функции-объекту;
    //            Массивы(Колекции)
    // тот же самый объект, все в js объект кроме Null и Underfined;
    // let arr = [1,2 ,3];
    // new Array(5) - если один, элемент то выведет пустой массив длиной 5
    // new Array(5, 2 ,3 ) - выведит [5,2,3];
    // let arrObj = {
    //     '0':1,
    //     '1':2,
    //     '2':3,
    //     length:3
    // };
    // arr[0]= 1; обращаемся только через квадратные скобки;
    // Array.prototype/
